{"address1": "Building 14", "address2": "LG1 to 3/F, Room 101, North District Yard No. 9, Dongran North Street Haidian District", "city": "Beijing", "country": "China", "website": "https://www.china-tower.com", "industry": "Telecom Services", "sector": "Communication Services", "longBusinessSummary": "China Tower Corporation Limited, together with its subsidiaries, provides telecommunication tower infrastructure services in the People's Republic of China. The company engages in the construction, maintenance, and operation of base station ancillary facilities, such as telecommunications towers and public network coverage in high-speed railways and subways, and large-scale indoor distributed antenna systems. It offers towers, and shelters or cabinets; and ancillary equipment to telecommunication services providers for installation of the telecommunications equipment. The company also provides maintenance services, including monitoring equipment operation, routine inspection, device breakdown handling, property upkeep, working environment protection, and operation analysis services. In addition, it offers power access, batteries, or back up power generation to the customers' telecommunications equipment; and indoor distributed antenna systems connecting telecommunication equipment, enabling them to receive and send indoor mobile telecommunication network signals, as well as mobile telecommunication network signals covering buildings, large venues, and tunnels. Further, the company provides backup power services to standby emergency power supply to corporate customers; battery exchange services to replaceable batteries to individual customers; and battery recharge services to corporate and individual customers, as well as engages in the provision of integrated information, power generation, and energy storage services. Additionally, it provides trans-sector site application and information services. The company was formerly known as China Communications Facilities Services Corporation Limited and changed its name to China Tower Corporation Limited in September 2014. The company was incorporated in 2014 and is headquartered in Beijing, the People's Republic of China.", "companyOfficers": [{"maxAge": 1, "name": "Mr. Zhiyong  Zhang", "age": 57, "title": "Exec. Chairman", "yearBorn": 1965, "exercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}, "unexercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}}, {"maxAge": 1, "name": "Mr. Xiaomin  Gu", "age": 57, "title": "GM, Gen. Counsel & Exec. Director", "yearBorn": 1965, "exercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}, "unexercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}}, {"maxAge": 1, "name": "Mr. Shaofeng  Hu", "age": 54, "title": "Chief Accountant", "yearBorn": 1968, "exercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}, "unexercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}}, {"maxAge": 1, "name": "Edgar  Fu", "title": "Investor Relations Director", "exercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}, "unexercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}}, {"maxAge": 1, "name": "Mr. Chunlei  Gao", "age": 56, "title": "Exec. Director", "yearBorn": 1966, "exercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}, "unexercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}}, {"maxAge": 1, "name": "Ms. Suet Wing  Leung A.C.I.S., A.C.S.", "age": 33, "title": "Company Sec.", "yearBorn": 1989, "exercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}, "unexercisedValue": {"raw": 0, "fmt": null, "longFmt": "0"}}], "auditRisk": 6, "boardRisk": 9, "compensationRisk": 2, "shareHolderRightsRisk": 10, "overallRisk": 8, "governanceEpochDate": 1680307200}